[
    {
        "title": "Bacon, Sweet Potato and Kale Breakfast Casserole",
        "description": "the aroma of crisp bacon, fresh kale, and sweet potatoes will fill your kitchen when you create this easy breakfast casserole dish",
        "servings": 4,
        "prepTime": 20,
        "cookTime": 30,
        "ingredients":[
            "8 slices of organic uncured bacon (cooked and cut into bite size pieces)",
            "1 large sweet potato (peeled, chopped into small cubes and cooked)",
            "2 large handfuls of organic kale leaves",
            "1 tsp cumin",
            "1 tsp coriander",
            "1 tsp fennel seed",
            "8 large organic pastured eggs",
            "1⁄4 cup unsweetened almond milk",
            "1 Tbsp nutritional yeast",
            "1 Tbsp coconut oil"
        ],
        "prepSteps":[
            "Preheat the oven to 375 degrees.",
            "Spread sweet potatoes on a baking sheet and bake for 15 minutes or until fork tender",
            "While the sweet potatoes are in the oven, cook the bacon on the stove.",
            "Grease a 9X13 casserole dish with coconut oil",
            "Beat the eggs in a large bowl with the almond milk and nutritional yeast. Add the bacon, sweet potato, kale, and spices to the egg mixture.",
            "Pour mixture into the prepared baking dish and cook for 30 minutes or until the eggs are firm.",
            "Serve warm and enjoy!",
            "Pre-slice and store in individual zip lock bags for a quick grab and go breakfast."
        ]
    },
    {
        "title": "Egg, Potato & Bacon Casserole",
        "description": "this traditional breakfast casserole is kicked up a notch with a hint of sweetness from the coconut cream and a spicy punch from the garlic. Make at the beginning of the week and enjoy all week long",
        "servings": 6,
        "prepTime": 25,
        "cookTime": 50,
        "ingredients":[
            "8 Eggs",
            "1 & 1/3 Cups Coconut Cream",
            "1 package of Bacon (diced)",
            "2 Sweet Potatoes (diced)",
            "1 Red or Brown onion (sliced)",
            "1 Red bell pepper (sliced)",
            "1 Garlic clove (crushed)",
            "Salt & Pepper"
        ],
        "prepSteps":[
            "Preheat an oven to 350°F",
            "In a fry-pan over medium heat, add the bacon. Cook until it starts to crisp up.",
            "Add the sweet potatoes and cook for another 5 minutes.",
            "Add the onion, red bell pepper and garlic. Cook for an additional 5- 10 minutes making sure the sweet potato is slightly cooked (A knife sticks into it easily but doesn’t mash).",
            "In a greased casserole dish, add the vegetable and bacon mix.",
            "In a bowl beat together the eggs and coconut cream.",
            "Pour the egg mix over the vegetable & bacon mix.",
            "Place the casserole into the oven and bake for 25-30 minutes or until the egg is completely cooked."
        ]
    },
    {
        "title": "Grab-N-Go Egg Muffins",
        "description": "all the flavors of a traditional breakfast omelet wrapped into the convenience of a grab-n-go egg muffin",
        "servings": 6,
        "prepTime": 20,
        "cookTime": 15,
        "ingredients":[
            "1 dozen organic, pastured eggs",
            "1 package of organic, nitrate/nitrite free bacon (fully cooked)",
            "1 green bell pepper (chopped)",
            "1⁄2 onion (chopped)",
            "1⁄2 tsp Himalayan salt",
            "1⁄2 tsp black pepper"
        ],
        "prepSteps":[
            "Pre-heat oven to 350 degrees. Grease a 12-cup muffin tin with coconut oil.",
            "In one large bowl, mix together cracked eggs and all other ingredients until fully combined.",
            "Evenly distribute the egg mixture between all 12 muffin cups. Bake for about 10 minutes or until the eggs are cooked through."
        ]
    },
    {
        "title": "Summer Grilled Scallop Salad",
        "description": "a delightful, crisp salad bursting with fresh tropical fruit, cool avocado, and spicy, smoky scallops, finished with a refreshing mango-lime dressing",
        "servings": 2,
        "prepTime": 30,
        "cookTime": 6,
        "ingredients":[
            "1/3 cup organic avocado (peeled and diced)",
            "2 Tbsp fresh, organic lime juice",
            "2 tsp organic olive oil",
            "12 whole wild sea scallops (tails removed)",
            "1 cup fresh organic pineapple (diced)",
            "2 Tbsp organic mango (chopped)",
            "2 tsp Caribbean spice",
            "4 cups organic Boston Bibb lettuce (shredded)"
        ],
        "prepSteps":[

        ]
    },
    {
        "title": "Buffalo Bolognese 'Pasta'",
        "description": "be transported to Italy with this grass-fed ground buffalo spaghetti squash pasta. The flavors of oregano and garlic greet your taste buds while the hint of onion and spinach melt into the ground buffalo meat",
        "servings": 4,
        "prepTime": 20,
        "cookTime": 45,
        "ingredients":[
            "1 cup organic onion (chopped)",
            "1 large spaghetti squash",
            "2 garlic cloves, (minced)",
            "1 bag of organic spinach",
            "1 cup organic pasta sauce (no added sugar)",
            "1 tsp black pepper",
            "1 tsp oregano",
            "1 pound organic, grass-fed ground buffalo"
        ],
        "prepSteps":[
            "Pre-heat oven to 400°. Cut the spaghetti squash in half lengthwise and place the two halves cut side down inside a glass baking dish with about 1⁄2 an inch of water in the bottom of the dish.",
            "Bake the spaghetti squash for 45 minutes or until the outside becomes tender.",
            "While the spaghetti squash is baking, heat a large pan over medium- high heat and cook the buffalo and all spices until the meat is no longer pink, about 6 minutes.",
            "Add the onion and garlic to the meat and cook for another 3 minutes or until the onions become translucent. Add the spinach and pasta sauce to the same pan and simmer for about 5 minutes or until all the spinach has wilted.",
            "Once spaghetti squash is cooked, remove from oven and using a spoon, scrape out the inside seeds of the squash and discard.",
            "Once the seeds have been removed, using a fork, scrape the “spaghetti” noodles out of the squash and distribute into 4 bowls.",
            "Evenly distribute the meat and pasta sauce mixture into each of the 4 bowls on top of the spaghetti. Serve warm and enjoy!"
        ]
    },
    {
        "title": "Sunday Meatloaf",
        "description": "this meatloaf dish is a classic favorite that has been updated with healthy ingredients without losing any flavor",
        "servings": 6,
        "prepTime": 10,
        "cookTime": 60,
        "ingredients":[
            "3 lbs organic grass-fed beef",
            "1 egg",
            "1 medium onion, (diced)",
            "3 garlic cloves",
            "8 ounces of Tesserae’s organic ketchup",
            "1/2 cup finely ground almond meal",
            "2 Tbsp Italian seasoning",
            "1/4 tsp Pink Himalayan salt"
        ],
        "prepSteps":[
            "Preheat the oven to 350 degrees.",
            "In a large bowl combine all ingredients and mix thoroughly with hands.",
            "Place meatloaf mixture in a greased bread pan and bake for an hour or until no longer pink in the center.",
            "Serve warm and enjoy!"
        ]
    },
    {
        "title": "Minestrone",
        "description": "this tomato-based soup blends harmoniously with an array of beans and vegetables and is amped up with the spicy and minty taste of basil",
        "servings": 4,
        "prepTime": 15,
        "cookTime": 40,
        "ingredients":[
            "4 cups vegetable broth",
            "1 tsp oregano (dried)",
            "2 tsp basil (dried)",
            "1 16-ounce can organic kidney beans",
            "1 16-ounce can organic cannellini beans",
            "1 cup organic peas",
            "4 garlic cloves (chopped)",
            "1 medium organic onion (diced)",
            "1 28-ounce can organic crushed tomatoes",
            "2 medium organic carrots (sliced)",
            "1 cup organic broccoli (chopped)"
        ],
        "prepSteps":[
            "Pour the vegetable broth into a large pot and bring to a boil.",
            "Add 2 garlic cloves and half of the diced onion, simmer for 15 minutes.",
            "Add all remaining ingredients and simmer on medium heat for 20 minutes or until the carrots are soft.",
            "Serve hot and enjoy!"
            
        ]
    },
    {
        "title": "Crock-Pot White Chicken Chili",
        "description": "nothing says home cooking like good old white chicken chili, with hearty pastured shredded chicken, an array of sweet vegetables, and nutty cumin spice",
        "servings": 4,
        "prepTime": 20,
        "cookTime": 4,
        "ingredients":[
            "2 16-ounce cans organic white beans",
            "1 tsp ground cumin",
            "1 tsp Himalayan salt",
            "4 medium organic red peppers (chopped)",
            "1 1⁄2 pounds organic, pastured chicken breasts or thighs",
            "6 garlic cloves (minced)",
            "2 tsp oregano",
            "2 medium organic onions (chopped)",
            "3 cups organic bone broth or chicken stock"
        ],
        "prepSteps":[
            "Combine all ingredients into a slow cooker or crock pot, placing the chicken breasts at the very bottom.",
            "Cover and cook on low for 7-8 hours or high for 4-5 hours.",
            "Once the chicken breasts reach 165 degrees, shred the chicken with two forks and stir all ingredients together.",
            "Serve hot and enjoy!"
        ]
    },
    {
        "title": "Spiced Bean and Veggie Soup",
        "description": "this perfect Fall dish will be sure to warm the heart and tummy with a medley of spiced beans and organic vegetables",
        "servings": 4,
        "prepTime": 20,
        "cookTime": 35,
        "ingredients":[
            "1 tsp dry thyme",
            "1 cup organic broccoli (chopped)",
            "1 1/2 cups organic carrots (diced)",
            "1 Tbsp coconut oil",
            "1 cup yellow onion (chopped)",
            "1 cup red bell pepper (chopped)",
            "3 cloves garlic (crushed)",
            "3 cups chicken broth",
            "2 whole bay leaves",
            "1/2 cup organic chick peas (canned)",
            "1 cup organic black beans (canned)",
            "1 cup green lentils",
            "2 Tbsp parsley (chopped)",
            "1 tsp freshly ground black pepper",
            "1 tsp cumin"
        ],
        "prepSteps":[
            "In a soup pot, heat oil over medium heat.",
            "Add onion and cook until translucent.",
            "Add red bell pepper, garlic, broth, bay leaves, parsley, black pepper, cumin, and thyme. Stir well.",
            "Add broccoli, carrots, black beans, lentils, and garbanzo beans.",
            "Simmer over medium heat for 30 minutes.",
            "Serve warm and enjoy!"
        ]
    },
    {
        "title": "Thirty-Minute Chili",
        "description": "grass-fed ground beef, bell peppers, tomato sauce, and beans are brought to life with a spicy chili seasoning and are topped off with fresh green avocado, making this the perfect chili",
        "servings": 6,
        "prepTime": 15,
        "cookTime": 25,
        "ingredients":[
            "1 28-ounce can organic diced tomatoes",
            "2 lbs organic, grass-fed ground beef",
            "1⁄2 cup organic onion (chopped)",
            "1 16-ounce can organic kidney beans",
            "1 16-ounce can organic black beans",
            "2 Tbsp organic chili seasoning",
            "1 tsp garlic powder",
            "1 tsp Himalyan salt",
            "1 cup beef broth or bone broth",
            "1 16-ounce can organic tomato sauce",
            "2 organic bell peppers (diced)",
            "2 avocados"
        ],
        "prepSteps":[
            "Brown beef in a Dutch oven or deep pot over medium-high heat for 4-5 minutes or until beef is no longer pink, stirring often.",
            "Add all seasonings and onion, sauté 1 minute over mediumhigh heat.",
            "Stir in diced tomatoes and remaining ingredients; bring to a boil over medium-high heat, stirring occasionally.",
            "Cover; reduce heat to low and simmer, stirring occasionally for about 20 minutes.",
            "Serve hot and top with 1⁄4 of an avocado and the optional raw cheese."
        ]
    },
    {
        "title": "California Greens",
        "description": "warm tender kale pairs seamlessly with hearty white beans and sundried tomatoes while the hint of garlic and drizzle of olive oil will bring you straight to the beaches of California",
        "servings": 6,
        "prepTime": 15,
        "cookTime": 20,
        "ingredients":[
            "1 16-ounce can organic white beans",
            "6 organic sundried tomatoes (chopped)",
            "1⁄2 cup organic chicken broth or bone broth",
            "4 garlic cloves (chopped)",
            "6 cups organic kale (stems removed and chopped)",
            "2 Tbsp organic extra virgin olive oil",
            "1⁄2 tsp paprika"
        ],
        "prepSteps":[
            "Bring 2 quarts of water to a boil in a large saucepan. Add kale and cook about 5 minutes until tender and bright green. Drain kale and set aside.",
            "Return saucepan to burner. Add chicken broth and heat over medium-high heat.",
            "Add garlic and cook 2 minutes. Stir in beans and cook for 6-8 minutes.",
            "Add paprika, salt, and sundried tomatoes and cook one additional minute.",
            "Return kale to saucepan and cook just until heated through (about 2 minutes).",
            "Drizzle with extra virgin olive oil and serve."
        ]
    }
]